{
  "intents": [
    {
      "tag": "salutation",
      "patterns": [
        "Bonjour",
        "Salut",
        "Coucou",
        "Hello"
      ],
      "responses": [
        "Bonjour! Comment puis-je vous aider aujourd'hui?",
        "Salut! En quoi puis-je vous assister?",
        "Coucou! Comment puis-je vous aider?"
      ]
    },
    {
      "tag": "adieu",
      "patterns": [
        "Au revoir",
        "À bientôt",
        "Ciao"
      ],
      "responses": [
        "À bientôt! Merci de votre visite.",
        "Passez une excellente journée!",
        "Au revoir! Revenez bientôt."
      ]
    },
    {
      "tag": "merci",
      "patterns": [
        "Merci",
        "Merci beaucoup",
        "C'est utile",
        "Je vous remercie!"
      ],
      "responses": [
        "Je suis ravi de pouvoir vous aider!",
        "N'hésitez pas si vous avez d'autres questions!",
        "Avec plaisir!"
      ]
    },
    {
      "tag": "formations",
      "patterns": [
        "Quelles formations proposez-vous?",
        "Quels types de cours offrez-vous?",
        "Pouvez-vous me parler de vos formations?"
      ],
      "responses": [
        "Nous proposons une large gamme de formations dans les domaines technologiques tels que la science des données, le développement d'application, la cybersécurité, l'intelligence artificielle, et plus encore.",
        "Nos cours couvrent une variété de compétences technologiques les plus demandées, y compris les langages de programmation, l'apprentissage automatique et l'intelligence artificielle.",
        "Nos programmes de formation sont conçus pour préparer les étudiants aux métiers de l'avenir, avec des expériences d'apprentissage pratiques et des certifications reconnues par les entreprises."
      ]
    },
    {
      "tag": "cout_formation",
      "patterns": [
        "Quel est le coût des formations?",
        "Combien dois-je payer pour une formation?",
        "Pouvez-vous me donner une estimation du coût?"
      ],
      "responses": [
        "Le coût des formations dépend de divers facteurs tels que la durée. Veuillez nous contacter le numero +22250000000000 pour en savoir plus selon votre choix.",
        "Les tarifs des formations varient en fonction de plusieurs critères (durée du programme, sa complexité et les ressources nécessaires. Veuillez nous contacter le numero +22250000000000 pour en savoir plus",
        "Le coût de nos formations est déterminé par des facteurs tels que la durée de la formation, sa complexité et les ressources impliquées. Pour obtenir une estimation précise, Veuillez nous contacter le numero +22250000000000."
      ]
    },
    {
      "tag": "certifications",
      "patterns": [
        "Proposez-vous des certifications?",
        "Vos cours sont-ils certifiés?",
        "Puis-je obtenir un certificat après avoir terminé un cours?"
      ],
      "responses": [
        "Oui, nous offrons des certifications reconnues par les entreprise dès la réussite de nos cours.",
        "Bien sùr, nos cours sont conçus pour vous préparer aux examens de certification des principales organisations de l'industrie technologique.",
        "Obtenir une certification auprès de nous peut stimuler vos perspectives de carrière et démontrer votre expertise aux employeurs."
      ]
    },
    {
      "tag": "enseignement",
      "patterns": [
        "Comment les cours sont enseignés ?",
        "Avez-vous des enseignants ?",
        "Quel est votre approche d'enseignement?"
      ],
      "responses": [
        "Vous avez un accès à notre plateforme d'apprentissage en ligne où vous pourrez commencer à apprendre immédiatement. Vous avez un instructeur.",
        "Nos cours sont dispensés en ligne et en présentiel, vous pouvez donc accéder aux supports à tout moment, où que vous soyez, à votre rythme.",
        "Notre approche est centré sur l'étudiant. Il doit faire des exercices pratiques. Tout se passe dans l'interactivité avec ses pairs et intructeur."
      ]
    },
    {
      "tag": "financier",
      "patterns": [
        "Quelles sont les options de paiement?",
        "Proposez-vous des plans de paiement échelonnés?",
        "Y a-t-il des réductions disponibles?"
      ],
      "responses": [
        "Nous acceptons divers modes de paiement, y compris les cartes de crédit/débit, MoMo et les virements bancaires.",
        "Nous proposons des plans de paiement flexibles pour rendre nos cours plus accessibles. Veuillez contacter notre équipe de support pour plus de détails.",
        "Nous offrons occasionnellement des réductions et des promotions sur nos cours. Suivez-nous sur les réseaux sociaux pour rester informé."
      ]
    },
    {
      "tag": "duree_formation",
      "patterns": [
        "Combien de temps durent les formations?",
        "Quelle est la durée des programmes?",
        "En moyenne, combien de temps dure une formation?"
      ],
      "responses": [
        "La durée des formations varie en fonction du programme, mais en général, elles durent de 3 à 6 mois pour une formation complète.",
        "Nos programmes ont une durée flexible, mais en moyenne, ils se situent entre 3 et 6 mois pour vous fournir une formation complète et approfondie.",
        "Vous pouvez noter que nos formations durent entre 3 à 6 mois en générale, offrant une expérience complète et immersive dans votre domaine choisi."
      ]
    },
    {
      "tag": "programmes_ia",
      "patterns": [
        "Formations en intelligence artificielle",
        "Cours d'IA",
        "Programmes IA"
      ],
      "responses": [
        "Découvrez nos formations avancées en intelligence artificielle, conçues pour vous donner un avantage sur le marché du travail en pleine croissance.",
        "Nos programmes d'intelligence artificielle offrent une formation complète allant des bases théoriques aux applications pratiques dans divers domaines.",
        "Apprenez les dernières avancées en intelligence artificielle grâce à nos cours interactifs et à nos instructeurs expérimentés."
      ]
    },
    {
      "tag": "inscription_facile",
      "patterns": [
        "Comment m'inscrire?",
        "Processus d'inscription simplifié",
        "Inscription rapide"
      ],
      "responses": [
        "Inscrivez-vous en quelques étapes simples : visitez notre site, choisissez votre programme, remplissez le formulaire d'inscription et tout commence.",
        "Notre processus d'inscription simplifié vous permet de vous inscrire rapidement et facilement à nos programmes de formation.",
        "L'inscription est rapide et facile! Il vous suffit de suivre les instructions sur notre site Web pour commencer votre parcours d'apprentissage."
      ]
    },
    {
      "tag": "prerequis",
      "patterns": [
        "Quels sont les prérequis?",
        "Est-ce que je dois avoir des compétences spécifiques?",
        "Y a-t-il des conditions préalables pour s'inscrire?"
      ],
      "responses": [
        "La plupart de nos programmes ne nécessitent aucune expérience préalable, juste une passion pour le sujet! Cependant, certaines formations avancées peuvent nécessiter des compétences techniques spécifiques.",
        "Nos formations sont accessibles à tous, des débutants aux experts. Les prérequis varient en fonction du programme, mais la passion pour l'apprentissage est le seul prérequis essentiel.",
        "Vous n'avez besoin que d'une passion pour le sujet pour commencer! Nous avons des cours adaptés à tous les niveaux, des débutants aux experts."
      ]
    },
    {
      "tag": "certifications_reconnues",
      "patterns": [
        "Les certifications sont-elles reconnues?",
        "Vos certifications ont-elles de la valeur sur le marché?",
        "Qu'en est-il des certifications en entreprise?"
      ],
      "responses": [
        "Nos certifications sont hautement respectées dans l'industrie, vous fournissant une validation professionnelle reconnue sur le marché.",
        "Les certifications que vous obtenez avec nous sont reconnues par les employeurs du monde entier, renforçant votre crédibilité et vos opportunités professionnelles.",
        "Nous délivrons des certifications industrielles hautement valorisées qui attestent de votre expertise et améliorent votre employabilité sur le marché du travail."
      ]
    },
    {
      "tag": "impoli",
      "patterns": [
        "Quel est ton problème ?",
        "Tu comprends rien !",
        "T'es nul !"
      ],
      "responses": [
        "Je suis ici pour aider, veuillez vous exprimer de manière respectueuse.",
        "Je vous prie de bien vouloir utiliser un langage approprié et respectueux.",
        "Je suis conçu pour aider, mais je demande à être traité avec respect."
      ]
    },
    {
      "tag": "sujets_formations",
      "patterns": [
        "Quels sujets sont couverts dans vos formations?",
        "De quels domaines traitez-vous?",
        "Quels sujets puis-je apprendre avec vous?"
      ],
      "responses": [
        "Nos formations couvrent un large éventail de sujets, y compris l'intelligence artificielle, la science des données, le développement web, la cybersécurité, et bien d'autres encore.",
        "Découvrez des sujets passionnants tels que l'apprentissage automatique, la gestion de projet et la transformation numérique dans nos programmes de formation.",
        "Vous pouvez apprendre tout, de l'IA et de la science des données à la cybersécurité et à la conception web, grâce à nos cours spécialisés et à nos instructeurs qualifiés."
      ]
    }
  ]
}
